app/controllers/static_pages_controller.rb

SELECT  `news`.* FROM `news` WHERE `news`.`resource` = 'weibo' LIMIT 50
---
  def home
    params['resource'] ||= 'weibo'
    @news = New.where(resource: params['resource']).limit(50)

SELECT  `news`.* FROM `news` WHERE `news`.`resource` = 'zhihu' LIMIT 30
---
  def home_resource
    resource = params['resource']
    @news = New.where(resource: resource).limit(30)